app/views/projects/show.html.erb

SELECT "punches".* FROM "punches" WHERE "punches"."project_id" = ?  [["project_id", 1]]
SELECT COUNT(*) FROM "punches" WHERE "punches"."project_id" = ?  [["project_id", 2]]
---
        <h3>Punches:</h3>
        <p><%= @project.punches.count %></p>