app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "Tracking system for Lab created using PHP and Laravel."], ["updated_at", 2017-06-07 23:20:51 UTC], ["id", 7]]
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update(project_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 3]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy