app/controllers/punches_controller.rb

  def create
    @project = Project.find(params[:project_id])
    @punch = @project.punches.create(punch_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "punches" ("accomplished", "start_time", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["accomplished", "asd"], ["start_time", 2017-05-30 00:00:00 UTC], ["project_id", 1], ["created_at", 2017-05-31 02:57:47 UTC], ["updated_at", 2017-05-31 02:57:47 UTC]]

  def destroy
    @project = Project.find(params[:project_id])
    @punch = @project.punches.find(params[:id])
    @punch.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "punches".* FROM "punches" WHERE "punches"."project_id" = ? AND "punches"."id" = ? LIMIT ?  [["project_id", 1], ["id", 17], ["LIMIT", 1]]
DELETE FROM "punches" WHERE "punches"."id" = ?  [["id", 17]]